# FailureMessageKey Operators (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FailureMessageKey Operators
FailureMessageKey Class See Also
---
The FailureMessageKey type exposes the following members.
# Operators
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equality | Determines whether two FailureMessageKeys are the same. |
| Inequality | Determines whether two FailureMessageKeys are different. |

# See Also
FailureMessageKey Class
Autodesk.Revit.DB Namespace